fio_result/test_xvdq1/fio.randwrite.128K.1.log
/dev/xvdq1: (g=0): rw=randwrite, bs=128K-128K/128K-128K/128K-128K, ioengine=libaio, iodepth=8
fio-2.0.13
Starting 1 process

/dev/xvdq1: (groupid=0, jobs=1): err= 0: pid=29998: Fri Jun 27 05:12:16 2014
  write: io=170368KB, bw=5638.8KB/s, iops=44 , runt= 30214msec
    slat (usec): min=23 , max=83 , avg=48.38, stdev= 4.88
    clat (msec): min=28 , max=741 , avg=181.39, stdev=79.64
     lat (msec): min=28 , max=741 , avg=181.44, stdev=79.64
    clat percentiles (msec):
     |  1.00th=[   94],  5.00th=[  109], 10.00th=[  117], 20.00th=[  125],
     | 30.00th=[  133], 40.00th=[  145], 50.00th=[  157], 60.00th=[  176],
     | 70.00th=[  200], 80.00th=[  229], 90.00th=[  273], 95.00th=[  322],
     | 99.00th=[  494], 99.50th=[  693], 99.90th=[  717], 99.95th=[  742],
     | 99.99th=[  742]
    bw (KB/s)  : min= 2271, max= 8401, per=100.00%, avg=5695.16, stdev=1479.93
    lat (msec) : 50=0.15%, 100=2.10%, 250=82.95%, 500=13.82%, 750=0.98%
  cpu          : usr=0.29%, sys=0.00%, ctx=1336, majf=0, minf=23
  IO depths    : 1=0.1%, 2=0.2%, 4=0.3%, 8=99.5%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=1331/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
  WRITE: io=170368KB, aggrb=5638KB/s, minb=5638KB/s, maxb=5638KB/s, mint=30214msec, maxt=30214msec

Disk stats (read/write):
  xvdq: ios=232/3990, merge=0/0, ticks=137/702209, in_queue=702835, util=99.87%