fio_result/test_xvdq1/fio.randwrite.8K.1.log
/dev/xvdq1: (g=0): rw=randwrite, bs=8K-8K/8K-8K/8K-8K, ioengine=libaio, iodepth=8
fio-2.0.13
Starting 1 process

/dev/xvdq1: (groupid=0, jobs=1): err= 0: pid=29970: Fri Jun 27 05:10:44 2014
  write: io=36296KB, bw=1204.2KB/s, iops=150 , runt= 30142msec
    slat (usec): min=9 , max=45 , avg=12.97, stdev= 1.55
    clat (msec): min=3 , max=259 , avg=53.10, stdev=31.96
     lat (msec): min=3 , max=259 , avg=53.11, stdev=31.96
    clat percentiles (msec):
     |  1.00th=[    5],  5.00th=[   10], 10.00th=[   24], 20.00th=[   36],
     | 30.00th=[   41], 40.00th=[   44], 50.00th=[   47], 60.00th=[   51],
     | 70.00th=[   57], 80.00th=[   65], 90.00th=[   86], 95.00th=[  126],
     | 99.00th=[  178], 99.50th=[  202], 99.90th=[  221], 99.95th=[  239],
     | 99.99th=[  260]
    bw (KB/s)  : min=  555, max= 4723, per=100.00%, avg=1206.29, stdev=562.93
    lat (msec) : 4=0.09%, 10=5.49%, 20=3.15%, 50=49.66%, 100=34.58%
    lat (msec) : 250=7.01%, 500=0.02%
  cpu          : usr=0.14%, sys=0.28%, ctx=4467, majf=0, minf=22
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=99.8%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=4537/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
  WRITE: io=36296KB, aggrb=1204KB/s, minb=1204KB/s, maxb=1204KB/s, mint=30142msec, maxt=30142msec

Disk stats (read/write):
  xvdq: ios=276/4517, merge=0/0, ticks=137/238540, in_queue=239338, util=99.86%