fio_result/test_xvdq1/fio.write.8K.1.log
/dev/xvdq1: (g=0): rw=write, bs=8K-8K/8K-8K/8K-8K, ioengine=libaio, iodepth=8
fio-2.0.13
Starting 1 process

/dev/xvdq1: (groupid=0, jobs=1): err= 0: pid=29895: Fri Jun 27 05:06:40 2014
  write: io=184128KB, bw=6136.8KB/s, iops=767 , runt= 30004msec
    slat (usec): min=9 , max=214 , avg=12.56, stdev= 2.54
    clat (msec): min=1 , max=253 , avg=10.41, stdev=16.51
     lat (msec): min=1 , max=253 , avg=10.43, stdev=16.51
    clat percentiles (msec):
     |  1.00th=[    4],  5.00th=[    5], 10.00th=[    5], 20.00th=[    5],
     | 30.00th=[    6], 40.00th=[    6], 50.00th=[    7], 60.00th=[    8],
     | 70.00th=[   10], 80.00th=[   12], 90.00th=[   15], 95.00th=[   20],
     | 99.00th=[   98], 99.50th=[  119], 99.90th=[  198], 99.95th=[  225],
     | 99.99th=[  249]
    bw (KB/s)  : min= 2653, max=10432, per=100.00%, avg=6164.45, stdev=1803.56
    lat (msec) : 2=0.01%, 4=3.43%, 10=70.82%, 20=21.03%, 50=1.95%
    lat (msec) : 100=1.82%, 250=0.93%, 500=0.01%
  cpu          : usr=0.61%, sys=1.34%, ctx=20349, majf=0, minf=23
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=23016/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
  WRITE: io=184128KB, aggrb=6136KB/s, minb=6136KB/s, maxb=6136KB/s, mint=30004msec, maxt=30004msec

Disk stats (read/write):
  xvdq: ios=232/22977, merge=0/0, ticks=160/238727, in_queue=239290, util=99.89%